test/fixtures/chargebee/subscription-legacy-plan.json

{
  "id": "AzZMxvTYTQUmw1Iw7",
  "plan_id": "somiibo-premium-monthly-1",
  "plan_quantity": 1,
  "plan_unit_price": 1995,
  "billing_period": 1,
  "billing_period_unit": "month",
  "customer_id": "AzZMxvTYTQUmw1Iw7",
  "plan_amount": 1995,
  "plan_free_quantity": 0,
  "status": "active",
  "current_term_start": 1692009453,
  "current_term_end": 1694687853,
  "next_billing_at": 1694687853,
  "created_at": 1678790253,
  "started_at": 1678790253,
  "activated_at": 1678790253,
  "updated_at": 1692009461,
  "has_scheduled_changes": false,
  "channel": "web",
  "resource_version": 1692009461863,
  "deleted": false,
  "object": "subscription",
  "currency_code": "USD",
  "shipping_address": {
    "first_name": "Legacy",
    "last_name": "User",
    "line1": "Kalograion",
    "city": "Larnaca",
    "state": "Larnaca",
    "country": "CY",
    "validation_status": "not_validated",
    "object": "shipping_address"
  },
  "due_invoices_count": 0,
  "mrr": 1995,
  "exchange_rate": 1,
  "base_currency_code": "USD",
  "cf_clientorderid": "1678790168794-0784",
  "has_scheduled_advance_invoices": false
}
